# 导入pyplot模块
import matplotlib.pyplot as plt

# 初始化figure
fig = plt.figure()

# 创建数据
gabm = [2.07204304, 2.33653884, 2.69998267, 2.83530052, 3.39271451, 4.58455437, 6.05599077, 8.78535706, 5.75447412,
        4.92403443, 0., 0., 0., 0.82795699, 0., 0., 0., 0., 0., 0.]
tcgm = [2.07255885, 2.33292944, 2.7009231, 2.84209435, 3.39643122, 4.57393984, 6.03099213, 8.93168132, 14.10671229,
        5.89874407, 2.05978259, 0., 0., 0., 0., 0., 0., 0., 0., 0.]
bcgm = [2.08690724, 2.34195704, 2.72669597, 2.82575188, 3.45161083, 4.69153424, 6.36793109, 9.63165266, 12.79928909,
        6.70787931, 2.99999998, 0., 0., 0., 0., 0., 0., 0., 0., 0.]
n = len(gabm)
times = range(n)
print(times)
left, bottom, width, height = 0.1, 0.1, 0.8, 0.8
ax1 = fig.add_axes([left, bottom, width, height])
ax1.plot(times, gabm, 'r')
ax1.plot(times, tcgm, 'r')
ax1.plot(times, bcgm, 'r')
ax1.set_xlabel('时间窗口(s)')
ax1.set_ylabel('映射代价')
ax1.set_title('title')
